# ── Core CLI tools ─────────────────────────────────────────────────────────────
brew "bat"
brew "fd"
brew "delta"
brew "eza"
brew "ffmpeg"
brew "fzf"
brew "fastfetch"
brew "gh"
brew "git"
brew "glow"
brew "gnupg"
brew "jq"
brew "lazygit"
brew "neovim"
brew "node"
brew "pinentry-mac"
brew "python"
brew "ripgrep"
brew "rsync"
brew "rustup"
brew "starship"
brew "stow"
brew "tmux"
brew "uv"
brew "wget"
brew "yazi"
brew "zoxide"
brew "asciinema"
brew "exiftool"
brew "imagemagick"
brew "modem-dev/tap/hunk"
brew "pass"
brew "pass-otp"
brew "macmon"
brew "anomalyco/tap/opencode"
brew "cmake"
brew "agg"

# ── Language servers and formatters ────────────────────────────────────────────
brew "bash-language-server"
brew "black"
brew "isort"
brew "lua-language-server"
brew "marksman"
brew "prettierd"
brew "shfmt"
brew "stylua"
brew "taplo"

# ── Zsh plugins (sourced from brew prefix in .zshrc) ──────────────────────────
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"

# ── Fonts (Nerd Fonts parity) ──────────────────────────────────────────────────
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
